[
  {
    "name": "George L. Plum",
    "title": ["Broker / Owner"],
    "text": "George is a life-long south Jersey native, a graduate of Gloucester Catholic High School, Rutgers University, a proud husband and father of two children. George's entrepreneurial spirit started at a young age as he worked to develop a successful landscaping business by the age of twenty one years old, while simultaneously earning a Bachelor's Degree from Rutgers University. Shortly after graduation, George obtained his real estate license.  Fast forward eleven years, gaining tremendous experience working in some of the largest franchises in real estate, George founded The Plum Real Estate Group in November of 2020.  With a business built on integrity, ambition and unparalleled communication, George has earned an impeccable reputation amongst his clients and peers.  George's vision in founding the Plum Real Estate Group is rooted in the desire to pass on the same personalized approach, the knowledge, tools and practices to his agents, while fostering a cooperative, non-competitive environment within his office, translating into mirrored results for both his agents and their clients.",
    "phone": "8565375464",
    "email": "george.plum@live.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/narxle1yicwv240fsyru.png"
  },
  {
    "name": "Robert J. Langi",
    "title": ["Realtor®"],
    "text": [
      "Rob was born and raised in Southern New Jersey and the Real Estate business has been in his family for over 30 years, with his father in both residential and commercial real estate. Rob has held his license since 2006, spending time in commercial and residential real estate as well as in a referral role while working in many other careers. One thing he has never stopped doing is caring for people and putting his clients first. He will work vigorously for you whether you are buying or selling a home and you can be sure you will be well taken care of in your real estate transaction."
    ],
    "phone": "6098685941",
    "email": "roblangi0784@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/vyblbqnjvtqgzappw55m.png"
  },
  {
    "name": "Christopher Plum",
    "title": ["Realtor®"],
    "text": [
      "Chris is another South Jersey native, who attended Gloucester Catholic before earning a degree at Northeastern University in Boston. In addition to being a realtor, Chris works as an insurances broker for Marks Insurance Group right here in Deptford. He prides himself on providing the best possible service to his clients by listening to your needs and requests as a buyer or seller and making himself available to you for anything!"
    ],
    "phone": "6093306173",
    "email": "chrisplum05@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/nyku8krjbpwy0jk2zqcl.png"
  },
  {
    "name": "Kim Vento",
    "title": ["Realtor®", "* Office Manager *", "Closing Coordinator"],
    "text": [
      "Kim grew up in Washington Township, New Jersey and attended Washington Township High School.  Kim previously held positions in the Insurance and Health Care Industry before starting her career in the Real Estate in 2005. ",
      "Kim has been married for over 30 years and is the proud mom of her three children.  She is active in her community and in the Glassboro Public School District.  As a licensed Realtor®, the Closing Coordinator and Office Manager for the Plum Real Estate Group, Kim looks forward to providing each client with a superior customer service experience."
    ],
    "phone": "8565375464",
    "email": "PlumREteam@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/eqhd0bx8okfkkszbhpop.png"
  },
  {
    "name": "Joe Matranga",
    "title": ["Realtor®"],
    "text": [
      "Joe is a Gloucester Catholic High School graduate, securing his bachelor’s degree from Glassboro State and his MBA from Rowan University. Subsequently earning his MBA, he was a professor at Rowan University.  He has been married to his beautiful wife, Rosemarie, for 39 years and is the proud father of their two children, Gina and Christina. In 1987 Joe founded Eagle Management Group, Inc., an exhibitor appointed contractor installing and dismantling tradeshows nationally, operating in 34 cities. Transitioning his education, experience, and excellent customer relations to the Real Estate arena, Joe exhibits passion, the ultimate level of integrity, and commitment in every real estate transaction."
    ],
    "phone": "6098474123",
    "email": "jmatranga@eaglemg.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/cvyetpjebro2lkynk6hw.png"
  },
  {
    "name": "Frank Mellor",
    "title": ["Realtor®"],
    "text": [
      "Born and raised in Deptford, New Jersey. Frank's most significant achievements have been his wife and three children. Nothing is more important to him than being a husband and a dad. Frank attended private school at Gloucester County Christian School in Pitman, New Jersey, and began a career as a journeymen electrician which he has spent the last 25 years doing. Always wanting to be in sales, real estate has granted him that opportunity. Not only is he excited to work with people on what can be one of the biggest decisions of their lives, but he also loves the satisfaction of helping them through what can be a difficult process. Frank's knowledge of residential construction is also a big reason why real estate suits him. He will do his best to. spot red flags that might turn into costly repairs in the future. Frank's familiarity with the surrounding towns and neighborhoods allows him to accurately price your home by finding “true” comparables in your area.My electrical/construction experience is also a bonus to most sellers. I really enjoy working with people. It is not that difficult for buyers and sellers to be exploited by unprofessional people. This is one of his main goals: to insure sellers and buyers are treated with respect, honesty and a complete sense of fairness. This is and always will be his commitment to you."
    ],
    "phone": "6096174281",
    "email": "Frankmellor.nj@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/cvl2irv4qdflq1kk0in1.png"
  },
  {
    "name": "Robert \"Bob\" Vicario",
    "title": ["REALTOR®"],
    "text": "Bob is a lifelong South Jersey resident. He attended Paul VI High School and Rowan University; he is also currently working on his MBA from Temple University. Bob developed a passion for real estate at a young age and has been a licensed agent since 2013. He has a broad range of knowledge in residential real estate and residential remodels and renovations. Customer service is Bob’s main priority, and he always strives to give his clients the best experience possible. He is always available for his clients no matter the time of day!",
    "phone": "609-451-SOLD(7653)",
    "email": "robertjvicario@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/juiyet9sebejkzelymxe.png"
  },
  {
    "name": "James Mancuso",
    "title": ["Realtor®"],
    "text": [
      "Jim is a graduate of Gloucester Catholic High School. He earned a Bachelor's degree in Computer Information Management from Neumann University and has a Masters Degree in Accounting from Neumann as well. James has been an active member of the Gloucester/Camden County community for over 20 years.",
      "Jim developed a strong passion for real estate while working in and studying in the finance industry for over ten years. Whether helping a buyers find their dream home or listing for those looking to sell, he strives to get you exactly what you are looking for. Jim is eager for the opportunity to get to work with you!"
    ],
    "phone": "8564041779",
    "email": "jimmancusojr17@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/ahwqkg2fqsdyqr50lvoq.png"
  },
  {
    "name": "Donald Bunce",
    "title": ["Realtor®"],
    "text": [
      "Donald is a veteran of the United States Air Force. With a lifetime of experience placing the needs of others in the forefront of overall greater success, Donald is read to do the same for you in your real estate journey. He holds a bachelor's degree in business management which has helped him to place an emphasis on personable customer service integrated with his core values of integrity and excellence as a standard.  Your home is your most valuable asset and it should be trusted only with those who have the same regard like Donald."
    ],
    "phone": "6095568501",
    "email": "donald.bunce85@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/mrhbjlslerzzqezyglc9.png"
  },
  {
    "name": "Nicholas J. Faragasso",
    "title": ["Realtor®"],
    "text": [
      "Nick, another South Jersey native and current Deptford Township resident, attended Gloucester Catholic High School before earning his degree in Marketing from Rutgers University. In addition to being a realtor, Nick works as a Contract Furniture Dealer with Emerald Business Supply in the South Jersey market. Nick prides himself on the details and works tirelessly for his clients. From start to finish, Nick is with you every step of the way and always has his clients best interest at heart!"
    ],
    "phone": "8565135761",
    "email": "Theplumrealestate@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/w6z3btcrsxwwkkfhvbte.png"
  },
  {
    "name": "William Wenglicki",
    "title": ["REALTOR®"],
    "text": [
      "Bill’s primary interest in real estate originally stemmed from the enjoyment of exploring and viewing new homes throughout the State of New Jersey, especially along the coastline.  Bill’s background in education and entertainment places service to others at his core, which also aligns well with the real estate profession.  Bill has been a public-school music teacher for 25 years. As a musician, Bill plays saxophone and sings lead vocals for the Starling Band, a South Jersey Wedding Band. In addition, Bill plays private and corporate cocktail hour and dinner services as a solo saxophonist with light recorded accompaniment.  In 2004, he married the love of his life and has been blessed with two wonderful children.  He also maintains a commission from the State of New Jersey as a Notary Public.  As a lifelong learner, Bill has continually challenged himself to reach new heights as a professional.  He completed his Doctorate in Educational Leadership in October 2020, and his next goal is to not only become a public-school administrator in the State of New Jersey, but also to work with you as a real estate professional.  One of Bill’s biggest strengths is his dedication and commitment to those he serves as well as his ability to see projects through to completion. "
    ],
    "phone": "8569829789",
    "email": "wjwenglicki@gmail.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/nij0dryza6clvluidvsa.png"
  },
  {
    "name": "Kyle Gilliano",
    "title": ["Realtor®"],
    "text": [
      "Kyle is a high school graduate of Gloucester County Institute Of Technology with a background in construction.  Born and raised in Mullica Hill, Kyle developed a strong passion for real estate while working as an Hvac technician on new construction real estate. Whether you are buying or a selling a home, he will do his best to use his knowledge and experience in the industry to guide you in each and every transaction."
    ],
    "phone": "8565357107",
    "email": "KyleGilliano@aol.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100094/pmoz3nztagdcufnp1gzm.png"
  },
  {
    "name": "John Aquino",
    "title": ["Realtor®"],
    "text": [],
    "phone": "6097811482",
    "email": "johnaquino1949@yahoo.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/v7uvsadmj8wleztwjwvq.png"
  },
  {
    "name": "Joe Granato",
    "title": ["Realtor® CRS"],
    "text": [
      "-RE/MAX Lifetime Achievement Award",
      "-RE/MAX Hall of Fame Member",
      "-Over 35 years experience",
      "-Certified Residential Specialist",
      "- NJAR Distinguished Sales Club",
      "",
      "LARGE OR SMALL JOE SELLS THEM ALL"
    ],
    "phone": "6093154779",
    "email": "joe@joegranato.com",
    "image": "https://res.cloudinary.com/chriscloud1738/image/upload/v1668100093/w3zt2fdn1vgssqvya0py.png"
  }
]
